import {FaHtml5} from "react-icons/fa";

export const Tasks = {
    Task: {
        mou_1: [
            {
                id:'mou1_task_1',
                name: 'Task 1 первого месяца',
                themeLess: 'HTML',
                primerUrl: 'https://cdn.phototourl.com/free/2026-07-08-21180331-bed5-43ec-809c-252ec1081761.png',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            } ,
            {
                id:'mou1_task_2',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_3',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_4',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_5',
                name: 'Task 1 первого месяца',
                themeLess: 'HTML',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_6',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            } ,
            {
                id:'mou1_task_6',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_6',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            }
        ],
        mou_2: [
            {
                id:'task_1',
                name: 'Task 1 второго месяца',
            },
            {
                id:'task_1',
                name: 'Task 2 второго месяца',
            }
            ,{
                id:'task_1',
                name: 'Task 3 первого месяца',
            },
            {
                id:'task_1',
                name: 'Task 4 первого месяца',
            },
            {
                id:'task_1',
                name: 'Task 5 первого месяца',
            }
        ]
    }
}