import {FaHtml5} from "react-icons/fa";

export const Tasks = {
    Task: {
        mou_1: [
            {
                id:'mou1_task_1',
                name: ' Задание 1 ',
                themeLess: 'HTML',
                primerUrl: 'https://cdn.phototourl.com/free/2026-07-08-21180331-bed5-43ec-809c-252ec1081761.png',
                description: 'Ознакомьтесь с компьютерной грамотностью и что такое HTML, Frontend. После выполнения нажмите кнопку отправить задание и напишите "Доступ" После вам дадут доступ к закрытой группе она понадобится в будущем! '
            } ,
            {
                id:'mou1_task_2',
                name: 'Задание 2',
                themeLess: 'HTML',
                primerUrl: 'https://cdn.phototourl.com/free/2026-07-19-712859f5-25cb-4cad-b26f-44ce85e35810.png',
                description: 'Создайте проект с нуля. После откройте в кодовом редакторе, и создайте index.html после в нем с помощью  html тегов которые вы прошли на уроке. Сверстайте то что находится на картинке - "Посмотреть пример"  По завершению вы должны заархивировать в «zip» Свой проект и Отправить задание  '
            },
            {
                id:'mou1_task_3',
                name: 'Задание 3',
                themeLess: 'HTML',
                primerUrl: '',
                description: 'Используйте свою фантазию! В первую очередь создайте новый проект с нуля. Дальше создайте в нем файл "index.html и "style.css" после  сверстайте все что хотите и задайте стили, на ваше усмотрение. По завершению вы должны заархивировать в «zip» Свой проект и Отправить задание '
            },
            {
                id:'mou1_task_4',
                name: 'Задание 4',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_5',
                name: 'Task 1 первого месяца',
                themeLess: 'HTML',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_6',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            } ,
            {
                id:'mou1_task_6',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_6',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            }
        ],
        mou_2: [
            {
                id:'mou2_task_1',
                name: 'Task 1 второго месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou2_task_2',
                name: 'Task 2 второго месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou2_task_3',
                name: 'Task 3 второго месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou2_task_4',
                name: 'Task 4 второго месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
        ]
    }
}

