import {FaHtml5} from "react-icons/fa";

export const Tasks = {
    Task: {
        mou_1: [
            {
                id:'mou1_task_1',
                name: ' Задание 1 ',
                themeLess: 'HTML',
                primerUrl: 'https://cdn.phototourl.com/free/2026-07-08-21180331-bed5-43ec-809c-252ec1081761.png',
                description: 'Ознакомьтесь с компьютерной грамотностью и что такое HTML, Frontend. После выполнения нажмите кнопку отправить задание и напишите "Доступ" После вам дадут доступ к закрытой группе она понадобится в будущем! '
            } ,
            {
                id:'mou1_task_2',
                name: 'Задание 2',
                themeLess: 'HTML',
                primerUrl: 'https://cdn.phototourl.com/free/2026-07-19-712859f5-25cb-4cad-b26f-44ce85e35810.png',
                description: 'Создайте проект с нуля. После откройте в кодовом редакторе, и создайте index.html после в нем с помощью  html тегов которые вы прошли на уроке. Сверстайте то что находится на картинке - "Посмотреть пример"  По завершению вы должны заархивировать в «zip» Свой проект и Отправить задание  '
            },
            {
                id:'mou1_task_3',
                name: 'Задание 3',
                themeLess: 'HTML',
                primerUrl: '',
                description: 'Используйте свою фантазию! В первую очередь создайте новый проект с нуля. Дальше создайте в нем файл "index.html и "style.css" после  сверстайте все что хотите и задайте стили, на ваше усмотрение. По завершению вы должны заархивировать в «zip» Свой проект и Отправить задание '
            },
            {
                id:'mou1_task_4',
                name: 'Задание 4',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'На этом этапе вам необходимо ознакомиться с Figma. узнать, что это за инструмент, для чего он используется и почему именно в нём создаются макеты, с которыми работают Front-end разработчики.\n' +
                    '\n' +
                    'После этого повторите весь пройденный материал, чтобы закрепить знания перед итоговой практикой.\n' +
                    '\n' +
                    'Далее перейдите к тесту, нажав кнопку «Посмотреть пример», и пройдите его.\n' +
                    '\n' +
                    'После успешного прохождения теста нажмите кнопку «Отправить задание» и сообщите  количество набранных баллов.\n' +
                    '\n' +
                    '⚠️ Важно: не забудьте отправить итоговый результат теста Мне после выполнения задания.'
            },
            {
                id:'mou1_task_5',
                name: 'Task 1 первого месяца',
                themeLess: 'HTML',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_6',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            } ,
            {
                id:'mou1_task_6',
                name: 'Task 1 первого месяца',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            },
            {
                id:'mou1_task_6',
                name: 'Задание 1',
                themeLess: 'CSS',
                primerUrl: '',
                description: 'Создайте адаптивную карточку пользователя с фотографией, именем, должностью и кнопкой «Подробнее». Используйте семантические HTML-теги и аккуратную структуру документа.'
            }
        ],
        mou_2: [
            {
                id:'mou2_task_1',
                name: 'Задание 1',
                themeLess: 'Git & JavaScript',
                primerUrl: '',
                description: 'Создайте Git-репозиторий, настройте Git и загрузите свой первый проект на GitHub. Затем напишите небольшую программу, используя основные типы данных JavaScript (string, number, boolean, null, undefined), и выведите результаты в консоль.'
            },
            {
                id:'mou2_task_2',
                name: 'Задание 2 ',
                themeLess: 'Условия',
                primerUrl: '',
                description: 'Создайте мини-приложение с использованием условных конструкций (if, else, switch). Пользователь вводит данные, а программа выводит разные результаты в зависимости от введённого значения. Используйте современный синтаксис ES6 (let и const).'
            },
            {
                id:'mou2_task_3',
                name: 'Задание 3 ',
                themeLess: 'Циклы, массивы и объекты',
                primerUrl: '',
                description: 'Создайте массив объектов с информацией о пользователях. Используя циклы, выведите данные каждого пользователя в консоль. Добавьте не менее 5 объектов и используйте различные свойства каждого из них.'
            },
            {
                id:'mou2_task_4',
                name: 'Задание 4',
                themeLess: 'DOM и события',
                primerUrl: '',
                description: 'Создайте интерактивную страницу с кнопкой и текстом. При нажатии на кнопку изменяйте содержимое страницы, цвет элементов или отображайте сообщение. Используйте методы работы с DOM и обработчики событий.'
            },
            {
                id:'mou2_task_5',
                name: 'Задание 5',
                themeLess: 'Функции',
                primerUrl: '',
                description: 'Создайте несколько функций для работы с данными пользователя. Используйте обычные, стрелочные и анонимные функции, а также передавайте функции как аргументы (callback). Свяжите результат работы функций с элементами DOM.'
            },
            {
                id:'mou2_task_6',
                name: 'Задание 6',
                themeLess: 'Методы массивов',
                primerUrl: '',
                description: 'Создайте массив товаров или пользователей и реализуйте обработку данных с помощью методов map(), filter(), find(), forEach() и sort(). Результат отобразите на странице в виде карточек.'
            },
            {
                id:'mou2_task_7',
                name: 'Задание 7',
                themeLess: 'Деструктуризация',
                primerUrl: '',
                description: 'Используйте деструктуризацию объектов и массивов, операторы spread, rest, optional chaining и оператор нулевого слияния (??). Реализуйте небольшой пример, демонстрирующий применение каждого из этих возможностей.'
            },
            {
                id:'mou2_task_8',
                name: 'Задание 8',
                themeLess: 'LocalStorage',
                primerUrl: '',
                description: 'Создайте небольшое приложение «Список задач». Пользователь должен иметь возможность добавлять, удалять и сохранять задачи в LocalStorage. После обновления страницы данные должны автоматически восстанавливаться.'
            },
        ]
    }
}

